import { Locations } from "../types/shops";

export const locations: Locations = {
  minsk: {
    name: "Минск",
    center: [53.54, 27.33],
    // shops: [
    //   {
    //     id: 1,
    //     coordinates: [53.9, 27.54],
    //     name: "Магазин на в историческом районе Романоской Слободы",
    //   },
    //   {
    //     id: 2,
    //     coordinates: [53.87, 27.46],
    //     name: "Магазин на в историческом районе Романоской Слободы",
    //   },
    //   {
    //     id: 3,
    //     coordinates: [53.87, 27.6],
    //     name: "Магазин на в историческом районе Романоской Слободы",
    //   },
    // ],
  },
  gomel: {
    name: "Гомель",
    center: [52.26, 31.0],
    // shops: [
    //   {
    //     id: 4,
    //     coordinates: [53.0, 27.53],
    //     name: "Магазин на октябрьской",
    //   },
    // ],
  },
  brest: {
    name: "Брест",
    center: [52.5, 23.4],
    // shops: [
    //   {
    //     id: 4,
    //     coordinates: [53.0, 27.53],
    //     name: "Магазин на октябрьской",
    //   },
    // ],
  },
  vitebsk: {
    name: "Витебск",
    center: [55.11, 30.1],
    // shops: [
    //   {
    //     id: 5,
    //     coordinates: [52.8, 27.54],
    //     name: "Магазин на октябрьской",
    //   },
    //   {
    //     id: 6,
    //     coordinates: [52.76, 27.51],
    //     name: "Магазин на октябрьской",
    //   },
    // ],
  },
  grodno: {
    name: "Гродно",
    center: [53.4, 23.49],
    // shops: [
    //   {
    //     id: 5,
    //     coordinates: [52.8, 27.54],
    //     name: "Магазин на октябрьской",
    //   },
    //   {
    //     id: 6,
    //     coordinates: [52.76, 27.51],
    //     name: "Магазин на октябрьской",
    //   },
    // ],
  },
  mogilev: {
    name: "Могилев",
    center: [53.54, 30.2],
    // shops: [
    //   {
    //     id: 5,
    //     coordinates: [52.8, 27.54],
    //     name: "Магазин на октябрьской",
    //   },
    //   {
    //     id: 6,
    //     coordinates: [52.76, 27.51],
    //     name: "Магазин на октябрьской",
    //   },
    // ],
  },
};
